<template>
  <layout-nav nav-link="Каталог">
    <app-title :font-size="'XL4'">
      Каталог продукции
    </app-title>
    <section class="my-20">
      Каталог отстутствует
    </section>
    <section class="my-20">
      <valuation-cards />
    </section>
    <article class="flex flex-col gap-4">
      <app-text font-size="SM">
        Интернет-магазин «СпецОкраска.ру» предлогает профессиональное окрасочное оборудование для всех сегментов
        промышленности и стройплощадок. Продаем окрасочное оборудование, минуя
        посредников, что позволяет предлагать самые выгодные цены. <br>
        Все позиции отвечают отечественным и мировым стандартам качества (ГОСТ, ISO)
      </app-text>
      <app-title font-size="XL">
        Ассортимент оборудования
      </app-title>
      <app-text font-size="SM">
        В нашем котологе собрано профессиональное оборудование для решения широкого спектра задач. В зависимости от вида
        деятельности можно выбрать:
      </app-text>
      <ul class="list-disc ml-10 grid grid-cols-1 gap-1 text-sm">
        <li v-for="(word,id) in firstList" :key="id">
          {{ word }}
        </li>
      </ul>
      <app-title font-size="XL" font-weight="MEDIUM">
        Сфера применения
      </app-title>
      <app-text font-size="SM">
        Наша продукция используется на промышленных и производственных объектах, на крупных и мелких строительных
        площадках, в автомастерских, Поставляются бюджетные варианты и
        оборудование премиум-класса
      </app-text>
      <app-text font-size="SM">
        Задачи, которые решает наша продукция:
      </app-text>
      <ul class="list-disc ml-10 grid grid-cols-1 gap-1 text-sm">
        <li  v-for="(word,id) in secondList" :key="id">
          {{ word }}
        </li>
      </ul>
      <app-text font-size="SM">
        Каталог окрасочного оборудования регулярно расширяется и пополняется самыми последними моделями.
        Квалифицированные менеджеры окажут помощь с выбором моделей. Доставка
        заказов производится по всей России. Есть вопросы? Звоните!
      </app-text>
    </article>
  </layout-nav>
</template>

<script lang="ts" setup>
import { reactive } from 'vue'
import { LayoutNav } from '@/widgets/navbar'
import { ValuationCards } from '@/widgets/valuation-cards'
import AppTitle from '@/shared/ui/app-title.vue'
import AppText from '@/shared/ui/app-text.vue'
import { useTitle } from '@/shared/lib/composables/use-title.ts'

useTitle('Каталог')
const firstList = reactive([
  'пневматическое, безвоздушное окрасочное оборудование',
  'краскопульты',
  'сварочные аппараты,',
  'оборудование для нанесения разметки,',
  'шлифовольные машины,',
  'клепальный инструмент,',
  'индукционные нагреватели,',
  'зарядные устройства,',
  'Также у нас имеются комплектующие для окрасочного оборудования (бочки, влогомаслоотделители и пр.} и сопутствующие товары (волики, кисти, пистолеты, ремкомплекты и пр.)'
])
const secondList = reactive([
  'Внутренняя и наружная отделка зданий,',
  'Нанесение огнеупорные и защитные составы,',
  'Гидроизоляция поверхностей,',
  'Теплоизоляция крыш, стен и других поверхностей зданий,',
  'Антикоррозионное напыление на металлоконструкции;',
  'Финишная отделка металлических, деревянных, пластиковых изделий,',
  'Создание декоративных покрытий с оригинальной структурой,',
  'Нанесение дорожной разметки,',
  'Транспортировка и перекочка жидких составов и многое другое.'
])
</script>

<style lang="scss" scoped></style>
